In [1]:
print ("I want to become a data scientist")

I want to become a data scientist

In [2]:
print ("I want to become a data scientist")

I want to become a data scientist

In [3]:
print ("I want to become a data scientist")

I want to become a data scientist

In [4]:
print ("Yes i can because god and my family is always with me")

Yes i can because god and my family is always with me

In [5]:
import pandas as pd

In [20]:
data = {"a" : [1,2,3,4],
        "b" : [4,5,6,7],
        "c" : ["sudh", "krish", "hitesh", "navin"]}

In [21]:
df = pd.DataFrame(data)

In [22]:
df

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin

In [23]:
df.set_index('a', inplace=True)

In [24]:
df

   b       c
a
1  4    sudh
2  5   krish
3  6  hitesh
4  7   navin

In [25]:
df = df.reset_index()

In [26]:
df

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin

In [28]:
data = {"a" : [1,2,3,4],
        "b" : [4,5,6,7],
        "c" : ["sudh", "krish", "hitesh", "navin"]}
df1 = pd.DataFrame(data, index = ['a', 'b', 'c', 'd'])

In [29]:
df1

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [30]:
df1.reindex(['b', 'c', 'd', 'a'])

   a  b       c
b  2  5   krish
c  3  6  hitesh
d  4  7   navin
a  1  4    sudh

In [31]:
df1

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [33]:
for i in df1.iterrows():
    print(i)

('a', a       1
b       4
c    sudh
Name: a, dtype: object)
('b', a        2
b        5
c    krish
Name: b, dtype: object)
('c', a         3
b         6
c    hitesh
Name: c, dtype: object)
('d', a        4
b        7
c    navin
Name: d, dtype: object)

In [34]:
for i,j in df1.iterrows():
    print(i, j)

a a       1
b       4
c    sudh
Name: a, dtype: object
b a        2
b        5
c    krish
Name: b, dtype: object
c a         3
b         6
c    hitesh
Name: c, dtype: object
d a        4
b        7
c    navin
Name: d, dtype: object

In [35]:
for i,j in df1.iterrows():
    print(j)

a       1
b       4
c    sudh
Name: a, dtype: object
a        2
b        5
c    krish
Name: b, dtype: object
a         3
b         6
c    hitesh
Name: c, dtype: object
a        4
b        7
c    navin
Name: d, dtype: object

In [38]:
for i in df1.iteritems():
    print(i)

('a', a    1
b    2
c    3
d    4
Name: a, dtype: int64)
('b', a    4
b    5
c    6
d    7
Name: b, dtype: int64)
('c', a      sudh
b     krish
c    hitesh
d     navin
Name: c, dtype: object)

/tmp/ipykernel_112/549805685.py:1: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for i in df1.iteritems():

In [39]:
df1

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [40]:
for col_name, column in df1.iteritems():
    print(col_name,column)

a a    1
b    2
c    3
d    4
Name: a, dtype: int64
b a    4
b    5
c    6
d    7
Name: b, dtype: int64
c a      sudh
b     krish
c    hitesh
d     navin
Name: c, dtype: object

/tmp/ipykernel_112/1608746075.py:1: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for col_name, column in df1.iteritems():

In [41]:
df

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin

In [42]:
df['a']

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [43]:
[i for i in df['a']]

[1, 2, 3, 4]

In [44]:
list (df['a'])

[1, 2, 3, 4]

In [45]:
df1

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [50]:
def test(x):
    return x.sum()
df1.apply(test)

a                      10
b                      22
c    sudhkrishhiteshnavin
dtype: object

In [51]:
df2 = df1[['a', 'b']]

In [52]:
df2

   a  b
a  1  4
b  2  5
c  3  6
d  4  7

In [53]:
df2.applymap(lambda x : x**2)

    a   b
a   1  16
b   4  25
c   9  36
d  16  49

In [54]:
def test1(x):
    return x**2
df2.apply(test1)

    a   b
a   1  16
b   4  25
c   9  36
d  16  49

In [55]:
df1

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [56]:
df

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin

In [57]:
df.sort_values('c')

   a  b       c
2  3  6  hitesh
1  2  5   krish
3  4  7   navin
0  1  4    sudh

In [58]:
df.sort_index()

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin

In [59]:
df.sort_index(ascending = False)

   a  b       c
3  4  7   navin
2  3  6  hitesh
1  2  5   krish
0  1  4    sudh

In [63]:
df3 = pd.DataFrame({"Desc" : ["Data science combines math and statistics, specialized programming, advanced analytics, artificial intelligence (AI) and machine learning with specific subject matter expertise to uncover actionable insights hidden in an organization's data. These insights can be used to guide decision making and strategic planning."]})

In [64]:
df3

                                                Desc
0  Data science combines math and statistics, spe...

In [68]:
pd.set_option("display.max_colwidth", 500)
df3 = pd.DataFrame({"Desc" : ["Data science combines math and statistics, specialized programming, advanced analytics, artificial intelligence (AI) and machine learning with specific subject matter expertise to uncover actionable insights hidden in an organization's data. These insights can be used to guide decision making and strategic planning."]})

In [69]:
df3

                                                                                                                                                                                                                                                                                                                            Desc
0  Data science combines math and statistics, specialized programming, advanced analytics, artificial intelligence (AI) and machine learning with specific subject matter expertise to uncover actionable insights hidden in an organization's data. These insights can be used to guide decision making and strategic planning.